-- phpMyAdmin SQL Dump
-- version 4.1.12
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1
-- Время создания: Апр 25 2014 г., 23:22
-- Версия сервера: 5.6.16
-- Версия PHP: 5.5.11

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `os_draenor`
--

-- --------------------------------------------------------

--
-- Структура таблицы `os_clusters`
--

CREATE TABLE IF NOT EXISTS `os_clusters` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `type` varchar(5) NOT NULL,
  `link` int(11) NOT NULL,
  `status` varchar(100) NOT NULL DEFAULT 'free',
  `cluster_id` int(11) NOT NULL,
  `data` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=101 ;

--
-- Дамп данных таблицы `os_clusters`
--

INSERT INTO `os_clusters` (`id`, `type`, `link`, `status`, `cluster_id`, `data`) VALUES
(1, 'S', 0, 'busy', 1, 'None'),
(2, 'S', 0, 'free', 2, 'None'),
(3, 'S', 0, 'free', 3, 'None'),
(4, 'S', 0, 'free', 4, 'None'),
(5, 'S', 0, 'free', 5, 'None'),
(6, 'S', 0, 'free', 6, 'None'),
(7, 'S', 0, 'free', 7, 'None'),
(8, 'S', 0, 'free', 8, 'None'),
(9, 'S', 0, 'free', 9, 'None'),
(10, 'S', 0, 'free', 10, 'None'),
(11, 'S', 0, 'free', 11, 'None'),
(12, 'S', 0, 'free', 12, 'None'),
(13, 'S', 0, 'free', 13, 'None'),
(14, 'S', 0, 'free', 14, 'None'),
(15, 'S', 0, 'free', 15, 'None'),
(16, 'S', 0, 'free', 16, 'None'),
(17, 'S', 0, 'free', 17, 'None'),
(18, 'S', 0, 'free', 18, 'None'),
(19, 'S', 0, 'free', 19, 'None'),
(20, 'S', 0, 'free', 20, 'None'),
(21, 'S', 0, 'free', 21, 'None'),
(22, 'S', 0, 'free', 22, 'None'),
(23, 'S', 0, 'free', 23, 'None'),
(24, 'S', 0, 'free', 24, 'None'),
(25, 'S', 0, 'free', 25, 'None'),
(26, 'S', 0, 'free', 26, 'None'),
(27, 'S', 0, 'free', 27, 'None'),
(28, 'S', 0, 'free', 28, 'None'),
(29, 'S', 0, 'free', 29, 'None'),
(30, 'S', 0, 'free', 30, 'None'),
(31, 'U', 0, 'busy', 31, '32;35;38;41'),
(32, 'U', 33, 'busy', 32, 'Александр Пушкин - стихи\nПИР ПЕТРА ПЕРВОГО \nНад Невою резво вьются\nФлаги пестрые судов;\nЗвучно с лодок раздаются\nПесни дружные гребцов;\nВ царском доме пир веселый;\nРечь гостей хмельна, шумна;\nИ Нева пальбой тяжелой\nДалеко потрясена.\n\nЧто пирует царь великий\nВ Питербурге-городке?\nОтчего пальба и клики\nИ эскадра на реке?\nОзарен ли честью новой\nРусской штык иль русской флаг?\nПобежден ли швед суровый?\nМира ль просит грозный враг?\n\nИль в отъятый край у шведа\nПрибыл Брантов утлый бот,\nИ пошел навстречу деда\nВсей семьей наш юный флот,\nИ воинственные внуки\nСтали в строй пред стариком,\nИ раздался в честь Науки\nПесен хор и пушек гром?\n\nГодовщину ли Полтавы\nТоржествует государь,\nДень, как жизнь своей державы\nСпас от Карла русский царь?\nРодила ль Екатерина?\nИменинница ль она,\nЧудотворца-исполина\nЧернобровая жена?\n\nНет! Он с подданным мирится;\nВиноватому вину\nОтпуская, веселится;\nКружку пенит с ним одну;\nИ в чело его целует,\nСветел сердцем и лицом;\nИ прощенье торжествует,\nКак победу над врагом.\n\nА'),
(33, 'U', 34, 'busy', 33, 'лександр Пушкин - стихи\n\nПИР ПЕТРА ПЕРВОГО \n\nНад Невою резво вьются\nФлаги пестрые судов;\nЗвучно с лодок раздаются\nПесни дружные гребцов;\nВ царском доме пир веселый;\nРечь гостей хмельна, шумна;\nИ Нева пальбой тяжелой\nДалеко потрясена.\n\nЧто пирует царь великий\nВ Питербурге-городке?\nОтчего пальба и клики\nИ эскадра на реке?\nОзарен ли честью новой\nРусской штык иль русской флаг?\nПобежден ли швед суровый?\nМира ль просит грозный враг?\n\nИль в отъятый край у шведа\nПрибыл Брантов утлый бот,\nИ пошел навстречу деда\nВсей семьей наш юный флот,\nИ воинственные внуки\nСтали в строй пред стариком,\nИ раздался в честь Науки\nПесен хор и пушек гром?\n\nГодовщину ли Полтавы\nТоржествует государь,\nДень, как жизнь своей державы\nСпас от Карла русский царь?\nРодила ль Екатерина?\nИменинница ль она,\nЧудотворца-исполина\nЧернобровая жена?\n\nНет! Он с подданным мирится;\nВиноватому вину\nОтпуская, веселится;\nКружку пенит с ним одну;\nИ в чело его целует,\nСветел сердцем и лицом;\nИ прощенье торжествует,\nКак победу над врагом\n\nАл'),
(34, 'U', 0, 'busy', 34, 'ександр Пушкин - стихи\n\nПИР ПЕТРА ПЕРВОГО \n\nНад Невою резво вьются\nФлаги пестрые судов;\nЗвучно с лодок раздаются\nПесни дружные гребцов;\nВ царском доме пир веселый;\nРечь гостей хмельна, шумна;\nИ Нева пальбой тяжелой\nДалеко потрясена.\n\nЧто пирует царь великий\nВ Питербурге-городке?\nОтчего пальба и клики\nИ эскадра на реке?\nОзарен ли честью новой\nРусской штык иль русской флаг?\nПобежден ли швед суровый?\nМира ль просит грозный враг?\n\nИль в отъятый край у шведа\nПрибыл Брантов утлый бот,\nИ пошел навстречу деда\nВсей семьей наш юный флот,\nИ воинственные внуки\nСтали в строй пред стариком,\nИ раздался в честь Науки\nПесен хор и пушек гром?\n\nГодовщину ли Полтавы\nТоржествует государь,\nДень, как жизнь своей державы\nСпас от Карла русский царь?\nРодила ль Екатерина?\nИменинница ль она,\nЧудотворца-исполина\nЧернобровая жена?\n\nНет! Он с подданным мирится;\nВиноватому вину\nОтпуская, веселится;\nКружку пенит с ним одну;\nИ в чело его целует,\nСветел сердцем и лицом;\nИ прощенье торжествует,\nКак победу над врагом.'),
(35, 'U', 0, 'busy', 35, '36;37'),
(36, 'U', 0, 'busy', 36, 'Александр Пушкин - стихи\n\nПИР ПЕТРА ПЕРВОГО \n\nНад Невою резво вьются\nФлаги пестрые судов;\nЗвучно с лодок раздаются\nПесни дружные гребцов;\nВ царском доме пир веселый;\nРечь гостей хмельна, шумна;\nИ Нева пальбой тяжелой\nДалеко потрясена.\n\nЧто пирует царь великий\nВ Питербурге-городке?\nОтчего пальба и клики\nИ эскадра на реке?\nОзарен ли честью новой\nРусской штык иль русской флаг?\nПобежден ли швед суровый?\nМира ль просит грозный враг?\n\nИль в отъятый край у шведа\nПрибыл Брантов утлый бот,\nИ пошел навстречу деда\nВсей семьей наш юный флот,\nИ воинственные внуки\nСтали в строй пред стариком,\nИ раздался в честь Науки\nПесен хор и пушек гром?\n\nГодовщину ли Полтавы\nТоржествует государь,\nДень, как жизнь своей державы\nСпас от Карла русский царь?\nРодила ль Екатерина?\nИменинница ль она,\nЧудотворца-исполина\nЧернобровая жена?\n\nНет! Он с подданным мирится;\nВиноватому вину\nОтпуская, веселится;\nКружку пенит с ним одну;\nИ в чело его целует,\nСветел сердцем и лицом;\nИ прощенье торжествует,\nКак победу над врагом.'),
(37, 'U', 0, 'busy', 37, 'None'),
(38, 'U', 0, 'busy', 38, '39;40'),
(39, 'U', 0, 'busy', 39, 'My life is good =)\nСупе пупер'),
(40, 'U', 0, 'busy', 40, 'None'),
(41, 'U', 0, 'busy', 41, '42'),
(42, 'U', 0, 'busy', 42, 'Александр Пушкин - стихи\n\nАнтология русской поэзии	\nВесна, весна, пора любви,\nКак тяжко мне твое явленье,\nКакое томное волненье\nВ моей душе, в моей крови...\nКак чуждо сердцу наслажденье...\nВсё, что ликует и блестит,\nНаводит скуку и томленье.\n               ______\n\nОтдайте мне метель и вьюгу\nИ зимний долгий мрак ночей.'),
(43, 'U', 0, 'free', 43, 'None'),
(44, 'U', 0, 'free', 44, 'None'),
(45, 'U', 0, 'free', 45, 'None'),
(46, 'U', 0, 'free', 46, 'None'),
(47, 'U', 0, 'free', 47, 'None'),
(48, 'U', 0, 'free', 48, 'None'),
(49, 'U', 0, 'free', 49, 'None'),
(50, 'U', 0, 'free', 50, 'None'),
(51, 'U', 0, 'free', 51, 'None'),
(52, 'U', 0, 'free', 52, 'None'),
(53, 'U', 0, 'free', 53, 'None'),
(54, 'U', 0, 'free', 54, 'None'),
(55, 'U', 0, 'free', 55, 'None'),
(56, 'U', 0, 'free', 56, 'None'),
(57, 'U', 0, 'free', 57, 'None'),
(58, 'U', 0, 'free', 58, 'None'),
(59, 'U', 0, 'free', 59, 'None'),
(60, 'U', 0, 'free', 60, 'None'),
(61, 'U', 0, 'free', 61, 'None'),
(62, 'U', 0, 'free', 62, 'None'),
(63, 'U', 0, 'free', 63, 'None'),
(64, 'U', 0, 'free', 64, 'None'),
(65, 'U', 0, 'free', 65, 'None'),
(66, 'U', 0, 'free', 66, 'None'),
(67, 'U', 0, 'free', 67, 'None'),
(68, 'U', 0, 'free', 68, 'None'),
(69, 'U', 0, 'free', 69, 'None'),
(70, 'U', 0, 'free', 70, 'None'),
(71, 'U', 0, 'free', 71, 'None'),
(72, 'U', 0, 'free', 72, 'None'),
(73, 'U', 0, 'free', 73, 'None'),
(74, 'U', 0, 'free', 74, 'None'),
(75, 'U', 0, 'free', 75, 'None'),
(76, 'U', 0, 'free', 76, 'None'),
(77, 'U', 0, 'free', 77, 'None'),
(78, 'U', 0, 'free', 78, 'None'),
(79, 'U', 0, 'free', 79, 'None'),
(80, 'U', 0, 'free', 80, 'None'),
(81, 'U', 0, 'free', 81, 'None'),
(82, 'U', 0, 'free', 82, 'None'),
(83, 'U', 0, 'free', 83, 'None'),
(84, 'U', 0, 'free', 84, 'None'),
(85, 'U', 0, 'free', 85, 'None'),
(86, 'U', 0, 'free', 86, 'None'),
(87, 'U', 0, 'free', 87, 'None'),
(88, 'U', 0, 'free', 88, 'None'),
(89, 'U', 0, 'free', 89, 'None'),
(90, 'U', 0, 'free', 90, 'None'),
(91, 'U', 0, 'free', 91, 'None'),
(92, 'U', 0, 'free', 92, 'None'),
(93, 'U', 0, 'free', 93, 'None'),
(94, 'U', 0, 'free', 94, 'None'),
(95, 'U', 0, 'free', 95, 'None'),
(96, 'U', 0, 'free', 96, 'None'),
(97, 'U', 0, 'free', 97, 'None'),
(98, 'U', 0, 'free', 98, 'None'),
(99, 'U', 0, 'free', 99, 'None'),
(100, 'U', 0, 'free', 100, 'None');

-- --------------------------------------------------------

--
-- Структура таблицы `os_commands`
--

CREATE TABLE IF NOT EXISTS `os_commands` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  `desc` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=25 ;

--
-- Дамп данных таблицы `os_commands`
--

INSERT INTO `os_commands` (`id`, `name`, `desc`) VALUES
(1, 'wclear', 'Очистка дисплея консоли'),
(2, 'wds', 'Общее дисковое пространство'),
(3, 'wtcls', 'Общее количество кластеров'),
(4, 'wcrf', 'Создание файла'),
(5, 'wfrs', 'Свободное место на жестком диске'),
(6, 'wpath', 'Текущее местонахождение'),
(7, 'wlogout', 'Выход из системы'),
(8, 'wcluster_size', 'Размер кластера'),
(9, 'wos_init', 'Инициализация системы. (Внимание! Это приведет к потери всех данных!)'),
(11, 'wcrd', 'Создание нового каталога'),
(12, 'wls', 'Просмотр содержимого директории'),
(13, 'wrmd', 'Удаление каталога'),
(14, 'wgo', 'Переход в каталог'),
(15, 'wgoback', 'Возврат в родительскую директорию'),
(16, 'wof', 'Открыть файл'),
(17, 'wadduser', 'Создание нового пользователя'),
(18, 'wdelf', 'Удаление файла'),
(19, 'wcrpr', 'Создание случайного процесса'),
(20, 'wkillall', 'Убийство всех процессов'),
(21, 'wshowproc', 'Список всех процессов системы'),
(22, 'wpush', 'Повышение приоритета процесса'),
(23, 'wkill', 'Убийство выбранного процесса'),
(24, 'wcrmpr', 'Создание нескольких процессов');

-- --------------------------------------------------------

--
-- Структура таблицы `os_nodes`
--

CREATE TABLE IF NOT EXISTS `os_nodes` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `type` varchar(100) NOT NULL,
  `file_kind` varchar(5) NOT NULL,
  `access` varchar(10) NOT NULL,
  `begin` int(11) NOT NULL,
  `size` int(11) NOT NULL,
  `name` varchar(100) NOT NULL,
  `parent` int(11) NOT NULL,
  `date` varchar(100) NOT NULL,
  `creator` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=12 ;

--
-- Дамп данных таблицы `os_nodes`
--

INSERT INTO `os_nodes` (`id`, `type`, `file_kind`, `access`, `begin`, `size`, `name`, `parent`, `date`, `creator`) VALUES
(1, 'S', 'F', '0-0-0', 1, 36, 'draenor.sys', -1, '21-04-2014', 1),
(2, 'U', 'D', '7-7-5', 31, 29, 'home', 0, '21-04-2014', 1),
(3, 'U', 'F', '7-7-5', 32, 2996, 'f1', 31, '21-04-2014', 1),
(4, 'U', 'D', '7-7-5', 35, 29, 'Dir1', 31, '21-04-2014', 1),
(5, 'U', 'F', '7-7-5', 36, 999, 'f2', 35, '21-04-2014', 1),
(6, 'U', 'F', '7-7-5', 37, 27, 'f3', 35, '21-04-2014', 1),
(7, 'U', 'RD', '7-5-5', 38, 30, 'Alex', 31, '21-04-2014', 1),
(8, 'U', 'F', '7-7-5', 39, 30, 'alex', 38, '21-04-2014', 2),
(9, 'U', 'F', '7-7-5', 40, 30, 'File1', 38, '25-04-2014', 2),
(10, 'U', 'RD', '7-5-5', 41, 32, 'User77', 31, '25-04-2014', 1),
(11, 'U', 'F', '7-7-5', 42, 320, 'stih', 41, '25-04-2014', 3);

-- --------------------------------------------------------

--
-- Структура таблицы `os_proccess`
--

CREATE TABLE IF NOT EXISTS `os_proccess` (
  `id` int(4) NOT NULL AUTO_INCREMENT,
  `priority` int(4) NOT NULL,
  `status` varchar(250) NOT NULL,
  `lifeTime` int(4) NOT NULL,
  `ram` int(4) NOT NULL,
  `totalTime` int(5) NOT NULL,
  `system_status` varchar(100) NOT NULL,
  `creator` int(3) NOT NULL,
  `nachalo` int(5) NOT NULL DEFAULT '0',
  `konets` int(5) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=7 ;

--
-- Дамп данных таблицы `os_proccess`
--

INSERT INTO `os_proccess` (`id`, `priority`, `status`, `lifeTime`, `ram`, `totalTime`, `system_status`, `creator`, `nachalo`, `konets`) VALUES
(1, 52, 'finish', 14, 478, 14, 'user', 3, 73, 127),
(2, 74, 'finish', 15, 632, 15, 'user', 3, 84, 162),
(3, 20, 'finish', 17, 571, 17, 'user', 3, 80, 162),
(4, 19, 'finish', 20, 550, 20, 'user', 3, 81, 165),
(5, 78, 'finish', 14, 290, 14, 'user', 3, 83, 156),
(6, 95, 'finish', 12, 4, 12, 'user', 3, 82, 122);

-- --------------------------------------------------------

--
-- Структура таблицы `os_users`
--

CREATE TABLE IF NOT EXISTS `os_users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  `pass` varchar(100) NOT NULL,
  `role` varchar(100) NOT NULL DEFAULT 'User',
  `home` int(5) NOT NULL,
  `location_id` int(11) NOT NULL DEFAULT '1',
  `status` tinyint(1) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=4 ;

--
-- Дамп данных таблицы `os_users`
--

INSERT INTO `os_users` (`id`, `name`, `pass`, `role`, `home`, `location_id`, `status`) VALUES
(1, 'Alexey', '1234', 'Admin', 0, 0, 1),
(2, 'Alex', '1234', 'User', 38, 38, 1),
(3, 'User77', '1234', 'User', 41, 41, 1);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
